{"problems":{"326":{"tag":{"گراف":true,"اکسترمال":true,"بازی ها":true},"dif":"متوسط","text":"یک صفحه شطرنج 20 در 20 خالی داریم که شایان و ابولفضل در آن بازی زیر را انجام میدهند.\nشایان در نوبت خود در یک خانه خالی یک اسب قرار میدهد به طوریکه هیچ اسب دیگری این خانه را تهدید نکنند. می دانیم که حرکت اسب به صورت L است.\nابولفضل در نوبت خود در یک خانه خالی یک سنگ می اندازد!\nهدف شایان این است که بیشترین تعداد اسب را در صفحه بگذارد و هدف ابولفضل کمینه کردن آن است. اگر دو بازیکن بهینه بازی کنند حداکثر چند اسب در صفحه قرار خواهند گرفت؟\n","hint":"\nخانه ها را سیاه و سفید رنگ کن. حرکت اسب رنگ را تغییر می دهد...\n","soloution":"\nاگر شایان در هر مرحله در یک خانه سفید اسب بگذارد می تواند حداقل نصف خانه های سفید را پر کند که ربع کل خانه هاست. از طرفی ابولفضل می تواند کاری کند که شایان حداکثر ربع خانه ها را پر کند. هر خانه از صفحه را یک راس گراف بگیرید. و بین دو راس یال میزنیم اگر با یک حرکت اسب بشه از یکی به دیگری رسید. ابولفضل گراف را به C4 ها افراز میکند ( در اخر توضیح می دم چجوری ) بعد اگر شایان یه راس از یه C4 رو زد ابولفضل راس رو به روش رو میزنه. در اینصورت دیگه شایان نمی تونه هیج راس دیگه ای از C4 رو بزنه.\nافراز یه صفحه 4 در 4 به C4 ها اینجوری هست. می تونید 20 در 20 رو بت بلوک های این درست کنید.\nA B C D\nC D A B\nB A D C\nD C B A","name":"اسب پلشت","adder":178926524},"1449":{"tag":{"خلاقیت":true},"dif":"متوسط","text":"تعداد جایگشت های 1 تا n که تعداد نابه جایی هایش بر n بخشپذیر باشد چند تا هستند؟\nنا به جایی تعداد i<j هایی هست که ai>aj باشه.\n","hint":"\nجواب !(n-1) هست.\n","soloution":"\nاگه عضو n رو در نظر نگیریم. به ازای همه جایگشت های n-1 تای دیگه دقیقا یه جا وجود داره که می تونیم عضو n رو بذاریم.","name":"نا به جایی و بخش پذیری","adder":178926524},"2600":{"tag":{"استقرا":true,"منطق":true},"dif":"متوسط","text":"در یک جزیره 100 تا چشم سبز زندگی می کنن. این چشم سبزها یک شاه دارن که خیلی ظالمه در ضمن این شاه از بین خودشون نیست. شاه که می بینه این چشم سبز ها خیلی مشتاقن که از جزیره برن و آزاد بشن دستور میده که هر کی می خواد آزاد بشه بیاد پیش من اگه چشم سبز بود آزادش می کنم و اگه چشم قرمز بود اعدامش می کنم. مشکل اینجاست که این بنده های خدا (چشم سبزها) نمی تونن با هم ارتباط برقرار کنن (مثلا نمی تونن به هم رنگ چشم های همو بگن, نه با حرف زدن و نه با اشاره و...). یه ریاضیدان میاد به جزیره ی چشم سبزها و برای چشم سبزها اثبات می کنه که حداقل یکی از ساکنان این جزیره چشم سبزه. این چشم سبزها از این گفته استفاده می کنن و طی 100 روز همگی آزاد میشن. حالا شما باید بگید که چجوری این 100 تا چشم سبز آزاد شدن؟! در ضمن هر یک از ساکنان این جزیره موقعی میره پیش شاه که مطمئن باشه چشم سبزه در غیر اینصورت نمیره.\n","hint":"\nثابت کنید در روز iام در صورتیکه دقیقا iچشم سبز داشته باشیم همه با هم می فهمند که چشم سبزند.\n","soloution":"\nاستقرایی ثابت می کنیم که در روز iام در صورتیکه دقیقا iچشم سبز داشته باشیم همه با هم می فهمند که چشم سبزند.\nپایه که همان حرف مرد ریاضی دان است!\nگام هم به اینصورت که اگر i+1 چشم سبز داشتیم همه در روز i+1 ام با خود فکر میکنند که هیچکس جمع را ترک نکرد پس حداقل i+1 چشم سبز داریم و از انجایی که فقط iچشم سبز می بیند به این نتیجه می رسد که خود چشم سبز است!","name":"چشم سبزها","adder":178926524},"2613":{"tag":{"ناوردایی":true},"dif":"آسون","text":"یک شاه شطرنج از گوشه پایین چپ شروع کرده و چون بسیار گیج هست در هر مرحله می تونه یکی از این ۳ حرکت رو انجام بده.\nبره بالا\nبره راست\nبره چپ پایین\nحالا شاه می خواد همه خونه ها رو دقیقا یک بار ببینه. ثابت کنید که اینکار با فرض اینکه خونه های شطرنج ۸*۸‌‌ هستن غیر ممکنه\n","hint":"\nبرای جدول هایی که حداقل یکی از طول یا عرضون 3k+1 یا 3k باشه میشه. چرا؟\n","soloution":"\nناوردایی بزنید. مختصات جایی که توشیم اگه x,y باشه توی هر مرحله x+y امون داره توی پیمانه ۳ دقیقا یکی زیاد میشه. بعد از x+y=0 هم شروع میکنیم ولی چون تعداد باقی مونده های ۱ یکی بیشتر از اون دوتای دیگه هست نمیشه!","name":"شاه گیج","adder":178926524},"2623":{"tag":{"لانه کبوتری":true},"dif":"آسون","text":"در مهمانی n نفر حضور دارند، هرکس با دیگران دست می دهد. نشان دهید در هر لحظه دو نفر وجود دارند به طوری که به تعداد برابر دست داده اند.\n","hint":"\nAi = ام i تعداد دست دادن های نفر \n\nامکان ندارد که همزمان دو نفر با\nAi = n - 1\nAj = 0\nوجود داشته باشند.\n","soloution":"\nمی دانیم که  \n0 <= Ai <= n - 1\n\nو n -1 و 0 هم باهم وجود ندارند چون امکان ندارد یکی با همه دست داده باشد و یکی با کسی دست نداده باشد\nپس Ai در هر لحظه n -1 حالت دارد و ما n نفر داریم\nپس بنا بر اصل لانه‌کبوتری دو نفر با Ai برابر وجود دارند.","name":"دست دادن در مهمانی","adder":178926524},"3123":{"tag":{"بازی ها":true},"dif":"آسون","text":"دو کپه سنگ 30 تایی و 25 تایی داریم. در هر مرحله می توانیم تعدادی سنگ از یک دسته کپه سنگ برداریم. دو نفر این بازی را به ترتیب انجام می دهند. کسی که نتواند حرکتی بزند بازی را می بازد. چه کسی استراتژی برد دارد؟\n","hint":"\nباید از تقارن استفاده کنی.\n","soloution":"\nنفر اول 5 سنگ از کپه سنگ 30 تایی بر می دارد تا تعداد سنگ ها در دو کپه سنگ برابر شود و بعد هر تعداد سنگ نفر دوم برداشت نفر اول از دسته ی دیگر بر می دارد.","name":"کیسه و سنگ","adder":178926524},"3264":{"tag":{"خلاقیت":true},"dif":"متوسط","text":"به یک مجموعه k متعادل می گوییم اگر بتوان آنرا به دو قسمت افراز کرد که جمع اعداد دو دسته برابر باشد و یکی از دسته ها k عضوی باشد. به ازای n>=3 ثابت کنید زیر مجموعه 2n عضوی از اعداد مثبت وجود دارد که به ازای هر k از 2 تا n ، این زیرمجموعه k متعادل باشد.\n","hint":"\nفیبوناچی!\n","soloution":"\nاول از همه 2n-1 عضو اول فیبوناچی رو بزارید توی مجموعه. اینا رو f1 تا f 2n-1 میگیم. حالا عضو آخر مجموعه رو طوری انتخاب کنید که f 2n-1 اگه بهش اضافه بشه نصف جمع کل بشه. حالا این مجموعه ۲ متعادل هست. برای اینکه از k متعادل به k+1 متعادل برسیم کافیه یه fi پیدا کنیم که fi-1 , fi--2 توی مجموعه نباشن و به جای fi اون تا رو اضافه کنیم!","name":"مجموعه k متعادل","adder":178926524},"3986":{"tag":{"گراف":true,"زوجیت":true},"dif":"آسون","text":"یک گراف ساده داریم که دقیقا دو راس درجه فرد دارد. ثابت کنید مسیری بین این دو راس وجود دارد.\n","hint":"\nمجموع درجات گراف همیشه زوج عه\n","soloution":"\nچون مجموع درجات گراف زوج هست اون دو تا راس درجه فرد باید توی یه مولفه همبندی باشن!","name":"گراف با دو راس درجه فرد","adder":178926524},"4357":{"tag":{"اکسترمال":true,"خلاقیت":true},"dif":"متوسط","text":"ما n+1 جایگاه داریم که در جایگاه اول n تا سنگ وجود دارد. در هر مرحله می توانیم یک کپه سنگ که در آن x سنگ قرار دارد را انتخاب کرده و یکی از سنگ های آن را x جایگاه به جلو حرکت دهیم. هدف جمع کردن همه سنگ ها در جایگاه n+1 ام است. اگر (f(n,k برابر با سقف n/k باشد ثابت کتید حداقل به\n(sigma i=1->n : f(n,i\nحرکت نیاز داریم.\n","hint":"\nروی سنگ ها عدد بنویسید و در هر مرحله سنگی که بیشترین عدد را دارد به جلو حرکت دهید.\n","soloution":"\nروی سنگ ها عدد بنویسید و در هر مرحله سنگی که بیشترین عدد را دارد به جلو حرکت دهید. در اینصورت سنگی که روی آن i نوشته شده در هر مرحله حداکثر i حرکت جلو می‌‌ رود. و سنگ i ام حداقل (f(n,i حرکت نیاز دارد.","name":"سنگ های جهنده","adder":178926524},"4712":{"tag":{"ریاضی":true},"dif":"آسون","text":"اثبات کنید تعداد اعداد اول نامتناهی است.\n","hint":"\nاز برهان خلف استفاده کن.\n","soloution":"\nفرض می کنیم p بزرگترین عدد اول باشد. از طرف می دانیم عددی که به اعداد اول قبل از خودش بخش پذیر نباشه اوله. پس اگه بیایم اعداد اول 2 تا P رو توی هم ضرب کنیم و آخر بعلاوه ی 1 کنیم  یه عدد داریم که از P بزرگتره و اول هم هست. پس به تناقض رسیدیم.","name":"اعداد اول","adder":178926524},"5082":{"tag":{"زوجیت":true,"استقرا":true},"dif":"متوسط","text":"ثابت کنید در مثلث خیام اگر سطر هارا از ۰ شماره گذاری کنیم در سطر \n2^n \nام به جز دو تا یک اول و آخرش تمام عددها زوجند. مثال : \n0: 1\n1: 1 1\n2: 1 2 1 \n. \n. \n.\n","hint":"\nروی n استقرا بزن و سعی کن برای هر \n1<=i<=2^(n+1)-1\nc(2^(n+1),i) \nرو برحسب تعدادی از c(2^n,j) ها  پیدا کنی. \n","soloution":" \nاستقرا میزنیم روی n : \nپایه : n=0   2^0=1 اوکیه\nفرض : n=k اوکی باشه \nحکم : باید ثابت کنیم\n 2^(k+1) هم اوکیه\n\nبه ازای هر i که \ni != 2^n , 1<=i<=2^(n+1)-1 \nc(2^(n+1),i)= \nsigma(j=0 ta i) c(2^n,j)*c(2^n,i-j) \nچرا درسته؟ \nو به ازای i= 2^n\nc(2^(n+1),2^n) = \nsigma(j=1 ta (2^n)-1) c(2^n,j)*c(2^n,2^n-j) + 2c(2^n,0)*c(2^n,2^n) \nچرا درسته؟","name":"توان دو های خیام","adder":178926524},"5151":{"tag":{"پیوستگی گسسته":true},"dif":"متوسط","text":"یه چند ضلعی داریم که ضلعاش 2 یا 3 هست طولش و از هر طول ضلع هم تعداد زوجی داره،حالا شما ثابت کنید که میشه تعدادی از اضلاع متوالی این چند ضلعیو انتخاب کرد به طوری که نصف محیط اون رو انتخاب کرده باشیم.\n","hint":"\nحکم قویتری رو اثبات کن،ثابت کن نصف اضلاعشو انتخاب میکنیم و به هدفمون میرسیم.\n","soloution":"\nبعد از اینکه نصف اضلاع رو به صورت دلخواه(متوالی باشن ولی) انتخاب کردیم یا بیشتر از نصف محیطه یا کمتر(اگه نصف باشه که حله) حالا بیا یه دونه از ضلعارو از یه طرف بکن و یکی دیگرو از طرف دیگه بچسبون ،میتونی بررسی کنی که حداکثر یه دونه مجموع طول این اضلاع تغییر میکنه،ولی با انجام اینکار تا وقتی برسیم به نیمه متمم انتخاب اولیمون از بیشتر از نصف به کمتر از نصف یا برعکس رسیدیم و چون 1 دونه 1 دونه طول مجموعه ضلعای انتخابیمون تغییر میکنه پس باید وسط کار به نصف محیط (که عددی صحیح هست) رسیده باشیم","name":"نصف محیط","adder":178926524},"5770":{"tag":{"شمارش":true,"زوجیت":true},"dif":"آسون","text":"جدولی m*n داریم و میخواهیم خانه های آن را سیاه سفید کنیم. به چند طریق میتوان این کاررا انجام داد که هر مربع 2*2 از جدول انتخاب کنیم زوج تا خانه ی سیاه داشته باشد؟\n","hint":"\n خانه های یک سطر و ستون رو رنگ کن. \n","soloution":" \nاگر رنگ خانه های اجتماع سطر اول و ستون اول رو تعیین کنیم جواب به صورت یکتا تعیین خواهد شد. \n2^(m+n-1)","name":"نقاشی جدول","adder":178926524},"7153":{"tag":{"ریاضی":true,"لانه کبوتری":true},"dif":"متوسط","text":"به یک رشته 3n تایی خفن می گوییم اگر از هر کدام از حروف a,b,c دقیقا n تا داشته باشد. در هر مرحله می توانیم دو جایگاه \"متوالی\" از رشته را در نظر گرفته و حرف آن دو را جا به جا کنیم. فاصله مینیمم تعداد حرکاتی است که نیاز داریم تا از یکی به دیگری برسیم. به ازای هر رشته خفن s ثابت کنید رشته خفن دیگری مثلا p هست که فاصله s و p حداقل 2 / 3 * n *n باشد.\n","hint":"\nبا هر حرکت تعداد نا به جایی ها دقیقا یکی تغییر میکند!\n","soloution":"\nابتدا فرض کنید ارزش a کمتر از b کمتر از c باشد و نا به جایی های رشته s را تعریف میکنیم تعداد i<j هایی که si > sj باشد. حالا با هر حرکت تعداد نا به جایی ها حداکثر یکی کم می شود. پس اگر تعداد نا به جایی ها x باشد برای رسیدن از s به a..ab..bc..c حداقل x حرکت نیاز داریم. پس اگر x >= 3* n*n / 2 بود مسئله حل است. در غیر اینصورت ارزش گذاری را برعکس می کنیم یعنی a پرارزش ترین است بعد b بعد c و تعداد نا به جایی ها از x به 3 *n *n منهای x تبدیل خواهد شد که از 2 / 3 *n *n بیشتر است.","name":"رشته ABC","adder":178926524},"7409":{"tag":{"گراف":true},"dif":"متوسط","text":"يك گراف ٣ منتظم دو همبند داريم ثابت كنيد به p4 ها افراز ميشود","hint":"ثابت كنيد تطابق كامل دارد","soloution":"گراف ٣ منتظم  دوهمبندتطابق كامل دارد(چرا؟) حال اگر اين تطابق را از گراف حذف كنيم گرافي دو منتظم خواهيم داشت كه تعدادي دور است(چرا؟) حال هر دور را جهت دهي ميكنيم ساعت گرد و هر يال تطابق هم دلخواه جهت ميدهيم حال p4 هاي ما ميشنود به ازاي هر يال تطابق يال وارده به سر يال تطابق و يال خارجه از ته يال تطابق و خود يال تطابق به اين شكل هر يال درون يك p4 مي أيد و فقط داخل يكي مي ايد.","name":"افراز به p4","adder":178926524},"8185":{"tag":{"استقرا":true,"اکسترمال":true},"dif":"آسون","text":"یه زمین دایره ای شکل داریم که محیطش 1 متره. روی محیط زمین n تا پمپ بنزین هستن که با اعداد 1 تا n شماره گذاریشون کردیم. توی i امین پمپ بنزین X_i لیتر بنزین وجود داره. X_i>=0 هستن و جمع X_i ها هم 1 میشه. حالا ما یه ماشین داریم که باکش اول کار خالیه و برای L متر جابجا شدن به L لیتر بنزین نیاز داره. ثابت کنید پمپ بنزینی وجود داره که بتونیم از اونجا در یک جهت خاص شروع به حرکت کنیم و کل محیط دایره رو دور بزنیم و به سر جای اولمون برگردیم. ","hint":" ثابت کنید یک پمپ بزنین وجود داره که بشه ازش ساعتگرد شروع  و کل زمین دایره‌ای شکل رو طی کرد. ","soloution":" میخوایم با استقرا روی n، تعداد پمپ بنزین ها، مسئله رو ثابت کنیم. به ازای n=1، حکم بدیهیه . به ازای n>1 ها، اول نشون میدیم پمپ بنزینی مثل X وجود داره که با شروع از اون و با باک خالی، بتونیم خودمونو به پمپ بنزین بعدی X در جهت ساعتگرد برسونیم. فرض خلف میکنیم همچین پمپ بنزینی نباشه، اونوقت مقدار بنزین هر پمپ بنزین اکیدن از مقدار فاصلش تا پمپ بنزین بعدیش در جهت ساعتگرد کمتره، اونشکلی جمع بنزین ها از محیط دایره کمتر میشه که تناقضه. پس پمپ بنزین X طبق خواسته ما وجود داره. حالا پمپ بنزین بعدی X در جهت ساعتگرد رو Y بگیرید. میگیم بیا بنزین Y رو بگیر و تو X بریز، بعدش Y رو حذف کن. شرایط مسئله هنوز برقراره و تعداد پمپ بنزینا یکی کم شده؛ پس طبق فرض استقرا، یه پمپ بنزینی هست که با شروع از اون در جهت ساعتگرد بشه دایره رو طی کرد. اگه اسم اون پمپ بنزین Z باشه، ما اینجا هم با شروع از Z کل دایره رو طی میکنیم. چرا؟ چون تا وقتی به X نرسیده که همه چی مثل شرایط n-1 پمپ بنزینمونه. وقتی هم به X رسید، چون باکش بیشتر مساوی 0 بنزین داره، با بنزینی که از X میگیره میتونه به Y برسه (طبق شرایط X) و از اونجا هم به پمپ بنزین بعدی میره. بعدش دوباره طبق شرایط n-1 پیش میره. اینشکلی گام استقرا ثابت میشه و حکم ثابت میشه.","name":"پمپ بنزین","adder":178926524},"9924":{"tag":{"گراف":true,"اکسترمال":true},"dif":"آسون","text":"در جمعی 2n+1 نفره هر مجموعه ای از n نفر را که در نظر بگیریم کسی از خارج این مجموعه همه رو میشناسه. ثابت کنید کسی هست که همه رو بشناسه!\n","hint":"\nبزرگترین خوشه رو در نظر بگیر!\n","soloution":"\nاول از همه اینکه بزرگترین خوشه حداقل n+1 راس داره. (چرا؟!) حالا اون n نفر دیگه رو اگه در نظر بگیری یه نفر از توی خوشه همه اونا رو میشناسه که چون توی خوشه هه هم هست پس یعنی همه رو میشناسه!","name":"دوست همه","adder":178926524}},"newProblems":[],"allNames":{"326":true,"1449":true,"2600":true,"2613":true,"2623":true,"3123":true,"3264":true,"3986":true,"4357":true,"4712":true,"5082":true,"5151":true,"5770":true,"7153":true,"7409":true,"8185":true,"9924":true}}